tests/org.jboss.tools.ws.ui.bot.test/resources/jbossws/message_soap12_out.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
        <GetBibleWordsByChapterAndVerse xmlns="http://www.webserviceX.NET">
            <BookTitle>Mark</BookTitle>
            <chapter>1</chapter>
            <Verse>1</Verse>
        </GetBibleWordsByChapterAndVerse>
  </soap12:Body>
</soap12:Envelope>
