tests/org.jboss.tools.ws.ui.bot.test/resources/jbossws/message_soap_out.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GetBibleWordsByChapterAndVerse xmlns="http://www.webserviceX.NET">
			<BookTitle>Mark</BookTitle>
			<chapter>1</chapter>
			<Verse>1</Verse>
		</GetBibleWordsByChapterAndVerse>
	</soap:Body>
</soap:Envelope>
